package lv_0
//[ 필수 구현 사항 ]
//- 과제 시작 전 어떻게 구현할 것인지에 그려 보는 과정입니다.
//    - 요구 사항별로 상세 기능을 생각합니다.
//    - 사용하면서 발생할 수 있는 예외 사항들을 고려합니다.
//
//[ 필요한 기능 ]
//요구사항1: 메인 메뉴판 화면
//: 메뉴 선택시 상세 메뉴화면으로 이동
//: 잘못된 번호 선택 시 예외처리
//: 프로그램 종료을 위한 번호 정의
//
//요구사항2: ~~~
//요구사항3: ~~~
//요구사항4: ~~~
//=========================================================================
/*
[대분류 메뉴]
0.종료 1.메인 메뉴 2.사이드 메뉴 3.음료 4.주문하기 5.장바구니

[메인 메뉴]
1.불고기버거 2.새우버거 3.데리버거 4.돌아가기

[사이드 메뉴]
1.감자튀김 2.오징어링 3.애플파이 4.돌아가기

[음료 메뉴]
1.콜라 2.제로콜라 3.사이다 4.환타 5.돌아가기

{ 공통 }
[추가 주문을 하시겠습니까?]
1.예 2.아니요

[장바구니]
<_불고기버거, 콜라, 감튀_>를 담았습니다.

[장바구니 수정]
0.전부 삭제 1.불고기버거 2.콜라 3.감튀
 */